[
  {
    "id": 1,
    "title": "Context API",
    "detail": "1. Context API can troubleshoot props drilling. 2. Provides two components - Context.provider context.consumer.  3. usestate, function, object, etc. can be sent by this API. 4. One value at a time. Arrays are used to send multiple values. 5. Only child nodes can access the value",
    "image": "https://bs-uploads.toptal.io/blackfish-uploads/components/seo/content/og_image_file/og_image/777655/react-context-api-4929b3703a1a7082d99b53eb1bbfc31f.png"
  },
  {
    "id": 2,
    "title": "HTML Semantic Elements",
    "detail": "1. It is a part of on-page SEO 2. Developers can find code easily. because it defines the context clearly. 3. Example: <article> , <aside> ,<details> ,<figcaption>, <figure> ,<footer>, <header>, <main>, <mark> , <nav>, <section> ,<summary>, <time> ",
    "image": "https://dotnettutorials.net/wp-content/uploads/2021/12/word-image-167.png"
  },
  {
    "id": 3,
    "title": "Elements of Modern Furniture Design",
    "detail": "Negative Space: You might not think that a lack of material could be a feature, but negative space is one of the elements most emphasized by modern designers. Form, as Louis H. Sullivan put it, should follow function. Any unnecessary shapes are taking up more room than they need to and therefore ",
    "image": "https://www.sofadreams.com/media/catalog/product/cache/c41fae4236734eb803fb4c6a8d783161/1/8/180214_ravenna_hocker_sandbeige_white_rq_3.jpg"
  },
  {
    "id": 4,
    "title": "Which is the Best Sofa Brand to Buy Online?",
    "detail": "We’ve made sure to put together whole collections of this kind of furniture. Know you’re getting a layout that works together. Naturally, you’ll be able to mix and match the colors as much as you want to in order to bring exactly the kind of layout you had in mind to your room. Considering using a little color-matching wisdom to get a better feel for what your layout will ultimately look like",
    "image": "https://www.sofadreams.com/media/catalog/product/cache/c41fae4236734eb803fb4c6a8d783161/w/a/wall_unit_wohnwand_white_saala_2.jpg"
  },
  {
    "id": 5,
    "title": " Best Modern Leather Sofas and Sectionals of 2021",
    "detail": "San Antonio L-Shaped Sectional If you’re looking to build an entire room around a single sectional, then the San Antonio might be the perfect pick for you. It’s got more than enough space for several individuals to rest and relax, which makes it a good pick for homeowners who want to swap out multiple pieces of furniture. It’s also great for those with large single-room apartments or condos.",
    "image": "https://www.sofadreams.com/media/catalog/product/cache/c41fae4236734eb803fb4c6a8d783161/e/c/eckcouch_mikrofaser_designersofa_modern_ragusa_l_form_beige_m4_1_1.jpg"
  },
  {
    "id": 6,
    "title": "Fasting Growing Types Of Luxury Sofas",
    "detail": "Leather sectionals come in several forms. Perhaps the most common are the L and U-shaped sectionals, which appear to have a floor plan that mirrors the look of these letters. Many pieces that are made in these particular styles are now also offered in a fabric form. This has further helped to contribute to their popularity.",
    "image": "https://www.sofadreams.com/media/catalog/product/cache/c41fae4236734eb803fb4c6a8d783161/w/o/wohnlandschaft_leder_calabria_xl_orange_schwarz_2.jpg"
  },
  {
    "id": 7,
    "title": "Best Modern Sofas For Hotel Lounges",
    "detail": "Companies that want to maintain the overall layout of a traditional piece of furniture without sacrificing the luxury and the look of a futuristic ultramodern design can try the Baltimore, which is shaped perfectly for a majority of hotel lounge layouts. Considering that you can order it with a matching table, you shouldn’t have any difficulty incorporating it into an existing room. ",
    "image": "http://cdn.home-designing.com/wp-content/uploads/2017/08/stylish-sofas-600x600.jpg"
  },
  {
    "id": 8,
    "title": "Futuristic Living Room Ideas + Inspiration",
    "detail": "Take a look at the space that your living room takes up and imagine what you might be able to do with it if it were completely empty. More than likely, your mind’s eyes have quickly turned to a rather unique color pallet, especially if you’re drawing any inspiration from the retro futuristic themes that have become so popular. Try using our custom Sofa Configurator App if you’re trying to envision what sort of furniture might work best.",
    "image": "https://i.pinimg.com/originals/4f/79/90/4f799057143aa8c9025ac7d90748e8c3.jpg"
  },
  {
    "id": 9,
    "title": "5 THINGS TO THINK ABOUT WHEN CHOOSING A SOFA",
    "detail": "This is a very important thing to think about when choosing a sofa, as it’s crucial to ensure your new sofa will suit the style and decor of the room it’s going into. If your room is traditionally styled, you’ll want to go with a sofa to match. If you have a modern home, contemporary sofas will fit in to the surroundings giving the room a sleek look.The Fabric you choose for your next sofa is arguably equally as important as the styling. Do you have a specific preference for leather sofas, or perhaps tweed – fabric is a big factor in whether or not a sofa is right for you.",
    "image": "https://www.furniture-barn.co.uk/live/blogs/sofa%20blog%201.jpg"
  },
  {
    "id": 10,
    "title": "Couches for Sports Fans",
    "detail": "Discerning New Orleans Saints fans will appreciate the Detroit leather sectional with integrated LED mood lighting. Its perfect gold color might also attract those who love Notre Dame or Alcorn State.The Oakland Raiders have perhaps one of the most noticeable looks, dating back to the days of Al Davis, John Madden and their unique way of managing the team. The team redefined itself so that Oakland locals could take pride in their silver and black.The Cincinnati Reds are a beloved team for baseball fans. They became the Big Red Machine in the 1970s and made quite a comeback in the National League. Fans love to wear the trademark shades.",
    "image": "https://media.istockphoto.com/photos/the-young-man-is-watching-a-sports-game-on-tv-picture-id1036943526?k=20&m=1036943526&s=612x612&w=0&h=4-ZJUUEFE9ZYwjPAV9NRgkSMzg6Mm8WrmlALo6Yen8c="
  }
]
