[
      {
            "id": 1,
            "title": "Turkish one-pan eggs & peppers (Menemen)",
            "detail": "STEP 1 Heat the oil in a heavy-based frying pan. Stir in the onions, pepper and chillies. Cook until they begin to soften. Add the tomatoes and sugar, mixing well. Cook until the liquid has reduced, season. STEP 2 Using a wooden spoon, create 4 pockets in the tomato mixture and crack the eggs into them. Cover the pan and cook the eggs over a low heat until just set. STEP 3 Beat the yogurt with the garlic and season. Sprinkle the menemen with parsley and serve from the frying pan with a dollop of the garlic-flavoured yogurt. ",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201531_11-80800f0.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 2,
            "title": "Grilled aubergines with spicy chickpeas & walnut sauce",
            "detail": "STEP 1 Heat 2 tbsp oil in a pan, add the onion and fry until soft and lightly browned, about 10 mins. Add the chilli, ginger and spices and mix well. Stir in the chickpeas, tomatoes and 5 tbsp water, bring to the boil, then simmer for 10 mins. Add a little salt and pepper and the lemon juice. STEP 2 Arrange the aubergines over a grill pan. Brush lightly with oil, sprinkle with salt and pepper, then grill until golden. Flip them over, brush again with oil, season and grill again until tender and golden. STEP 3 Mix the yogurt with the garlic, most of the walnuts and coriander and a little salt and pepper. Arrange the aubergine slices over a warm platter and spoon over the chickpea mix. Drizzle with the walnut sauce and scatter with the remaining walnuts and coriander.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-219528_11-95d4cab.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 3,
            "title": "DIY kofta burgers",
            "detail": "STEP 1 Tip the mince into a large bowl (use a clean washing-up bowl if you don’t have anything big enough) with all the other burger ingredients and a good pinch of salt. Roll up your sleeves, get your hands into the mix and squelch everything together through your fingers until completely mixed. Pat the mix into 16 small burgers. These may now be frozen for up to 1 month or chilled up to a day ahead. STEP 2 To cook, heat grill to its highest setting and lay the burgers in a single layer on a baking tray (you may need to do this in batches, depending on how big your tray is). Grill on the highest shelf for 5-6 mins on each side until browned and cooked through. Pile burgers onto a platter and serve with all the accompaniments, so everyone can construct their own sandwich.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-424790_11-d0de898.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 4,
            "title": "Turkish pizza with spiced pomegranate beef & feta",
            "detail": "STEP 1 Mix the dough following pack instructions (leave about 2 tbsp of the bread mix in the bag for dusting and rolling out later). Knead for 8-10 mins, then coat the dough in oil, place in a large bowl and cover. Leave to rise until doubled in size. The warmer your kitchen is, the faster it will rise, but generally it should take 1-2 hrs. STEP 2 Heat oven to 240C/220C fan/gas 9 (or the highest setting). Sprinkle 2 baking trays with a little of the reserved flour and place in the oven to heat up. STEP 3 Heat the olive oil in a large frying pan until hot. Add the onions and garlic, and cook for a few mins until softened. Add the beef and let it brown for about 5 mins, breaking up the mince as it cooks. Pour off any excess oil. Add the spices, chilli, 2 tbsp of the tomato purée, 5 tbsp of the pomegranate molasses and some seasoning. Cook for 1 min, then remove from the heat.STEP 4 Divide the dough into 6 balls. Sprinkle the remaining flour over a work surface and roll out the dough, each to about 25cm across. Remove the trays from the oven and place 2 pizza bases on each (you’ll need to cook in batches). Spread the remaining tomato purée on each base. Top with the meat mixture, peppers, feta and pine nuts. Cook for 10 mins or until the bases are cooked through and golden brown around the edges. Drizzle over the remaining pomegranate molasses and serve.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/turkishpizza-6d6af5f.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 5,
            "title": " Spiced lamb & feta gozleme with special tomato sauce",
            "detail": "STEP 1 For the dough, mix the yeast, sugar and 175ml lukewarm water in a small bowl. Stir to dissolve the yeast, then set aside for 10 mins, or until the liquid starts to froth. STEP 2 Mix the flour with ½ tsp salt in a big bowl. Make a well in the centre, pour in the yeasty mixture and olive oil, and mix to a dough. Knead for 10 mins, then put the dough in a lightly oiled bowl and cover with oiled cling film. Leave somewhere quite warm until doubled in size. STEP 3 Meanwhile, make the filling. Heat the oil in a frying pan, add the mince and fry, breaking up lumps as you go, until well browned. Stir in the garlic, spices and raisins, and fry for a few more mins, then turn off the heat and stir in the lemon zest, spring onions, pine nuts and seasoning. Set aside to cool a little. STEP 4 Divide the dough into 4. Working a piece at a time, roll out on a lightly floured surface to 25 x 30cm, without the dough splitting. With a long edge of the pastry laying in front of you, spoon ¼ of the mince on the bottom half – leaving a 2cm border all round. Crumble over ¼ of the feta. Fold the other half of the dough over the filling, folding in and pinching the edges to seal in the lamb. Repeat with the remaining ingredients.STEP 5 Heat a large frying pan over a high heat and brush the gozleme all over with oil. STEP 6 Cook in batches for 3-5 mins on each side, or until golden and heated through. Quickly mix the tomato ketchup, pomegranate and onion, and serve with the hot, crispy gozleme.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1309456_3-2dac7ef.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 6,
            "title": "Imam bayildi with BBQ lamb & tzatziki",
            "detail": "STEP 1 Heat oven to 190C/170C fan/gas 5. Halve the aubergines lengthways and score the flesh side deeply, brush with a good layer of olive oil and put on a baking sheet. Roast for 20 mins or until the flesh is soft enough to scoop out. STEP 2 Fry the onion in a little oil until soft, add the garlic and cinnamon and fry for 1 min. Once the aubergines are cool enough to handle, scoop out the centres. Roughly chop the flesh and add it to the onions. Halve the tomatoes, scoop the seeds and juice into a sieve set over a bowl, then chop the flesh. Add the chopped tomatoes to the pan and cook everything for 10 mins until nice and soft. Add a little more oil if you need to. Stir in the parsley, leaving a little for scattering at the end. STEP 3 Lay the aubergine halves in a baking dish and divide the tomato mixture between them. Pour over the juice from the tomatoes, drizzle with more olive oil and bake for 30 mins until the aubergines have collapsed. STEP 4 Meanwhile, mix the tzatziki ingredients together and put in a small serving bowl. STEP 5 Season the lamb with salt, black pepper and a pinch of paprika. Griddle, grill or barbecue for 3 mins on each side or until the fat is nicely browned, then put in a serving dish and squeeze over the lemon halves. Scatter the aubergines with parsley, then serve with the lamb and tzatziki.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-356518_11-edb81df.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 7,
            "title": "Turkish one-pan eggs & peppers (Menemen)",
            "detail": "STEP 1 Heat the oil in a heavy-based frying pan. Stir in the onions, pepper and chillies. Cook until they begin to soften. Add the tomatoes and sugar, mixing well. Cook until the liquid has reduced, season. STEP 2 Using a wooden spoon, create 4 pockets in the tomato mixture and crack the eggs into them. Cover the pan and cook the eggs over a low heat until just set. STEP 3 Beat the yogurt with the garlic and season. Sprinkle the menemen with parsley and serve from the frying pan with a dollop of the garlic-flavoured yogurt. ",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201531_11-80800f0.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 8,
            "title": "Grilled aubergines with spicy chickpeas & walnut sauce",
            "detail": "STEP 1 Heat 2 tbsp oil in a pan, add the onion and fry until soft and lightly browned, about 10 mins. Add the chilli, ginger and spices and mix well. Stir in the chickpeas, tomatoes and 5 tbsp water, bring to the boil, then simmer for 10 mins. Add a little salt and pepper and the lemon juice. STEP 2 Arrange the aubergines over a grill pan. Brush lightly with oil, sprinkle with salt and pepper, then grill until golden. Flip them over, brush again with oil, season and grill again until tender and golden. STEP 3 Mix the yogurt with the garlic, most of the walnuts and coriander and a little salt and pepper. Arrange the aubergine slices over a warm platter and spoon over the chickpea mix. Drizzle with the walnut sauce and scatter with the remaining walnuts and coriander.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-219528_11-95d4cab.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 9,
            "title": "DIY kofta burgers",
            "detail": "STEP 1 Tip the mince into a large bowl (use a clean washing-up bowl if you don’t have anything big enough) with all the other burger ingredients and a good pinch of salt. Roll up your sleeves, get your hands into the mix and squelch everything together through your fingers until completely mixed. Pat the mix into 16 small burgers. These may now be frozen for up to 1 month or chilled up to a day ahead. STEP 2 To cook, heat grill to its highest setting and lay the burgers in a single layer on a baking tray (you may need to do this in batches, depending on how big your tray is). Grill on the highest shelf for 5-6 mins on each side until browned and cooked through. Pile burgers onto a platter and serve with all the accompaniments, so everyone can construct their own sandwich.",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-424790_11-d0de898.jpg?quality=90&webp=true&resize=375,341"
      },
      {
            "id": 10,
            "title": "Hot cumin lamb wrap with crunchy slaw & spicy mayo",
            "detail": "STEP 1 Heat a griddle pan. Rub the lamb steaks with the oil, cumin and some seasoning. Griddle for about 3-4 mins on each side or until cooked to your liking. Place to one side on a plate to rest. STEP 2 In a large bowl, stir the sugar into the vinegar until dissolved. Add the carrots, spring onions, cabbage and some seasoning, and toss together. STEP 3 Blitz the whole peppers and the mayo in a food processor. Add a heap of the salad to each flatbread. Slice the lamb, trimming off any excess fat and lay on top of the salad, drizzling with the resting juices. Spoon over the mayo and scatter with a few of the sliced peppers. Roll up and eat. If using pitta, split and stuff. Serve any extra salad on the side",
            "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1031455_10-b76d9d0.jpg?quality=90&webp=true&resize=375,341"
      }
]
